#include <my_rpProV2.h>
#include <MyRP_PRO_CHEA2.h>
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 50;    //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 120;  //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 120;  //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ

void setup() {
  setup_rp2350_pro();
  set_motor();
  
  RobotSetup();
  _setting();


  //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล
  //arm_up_close();  //--->> ยกแขนขึ้นหุบฝ่ามือเข้า
  arm_down_open();  //--->> แขนลงกางฝ่ามือออก
                    //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล

  // readSerialCommand();  //สำหรับตั้งค่าเซอร์โวผ่าน Serial
  sw();  //--->> คำสั่งรอกดปุ่ม
  ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่
  Mission();


  ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ
  MotorStop();

  servo_36.detach();
  servo_34.detach();
  servo_35.detach();
}

void loop() {
  // Serial.print( analogRead(46) );   Serial.print( "   " );   Serial.println( analogRead(47) );
  // Serial.println(my.gyro('z'));
  // delay(10);
  // Serial.print(sensorMin_A[0]);
}
