void Mission() {
  //TestMotor(); //คำสั่งทดสอบมอเตอร์ โดยหมุนซ้ายไปข้างหน้าก่อน แล้วค่อยหมุนขวาไปข้างหน้า
  RefLineValue(500);           // ค่าในการจับเส้น เซนเซอร์หน้า หลัง
  RefCenterLineValue(800);     // ค่าในการจับเส้น เซนเซอร์คู่กลาง
  SetToCenterSpeed(20);        // ความเร็วเข้ากลางหุ่น
  SetTurnSpeed(60);            // ความเร็วเลี้ยวเข้าแยก l L r R
  TurnSpeedLeft(25, 80, 50);   //เลี้ยวแบบ q
  TurnSpeedRight(80, 25, 50);  //เลี้ยวแบบ e
  TrackLineColor(0);           // 0 >> พื้นขาวเส้นดำ ||  1 >> พื้นดำเส้นขาว
  Delay_c_F(1500);             //เวลาเดินหน้า แบบ c
  Delay_c_B(1500);             //เวลาถอยหลัง แบบ c
  Dottedline(0);               //ไม่มีเส้นประใส่ 0 มีเส้นประใส่ 1
  mode_soft_start(0);          // 0 >> ออกตัวไม่สมูท || 1 >> ออกตัวสมูท
  // ModeSpdPID(0, 100, -5;
  ModeSpdPID(1, 100, -100); //แบบปกติ
  // ModeSpdPID(2, 100, -5); //โค้งเยอะๆ
  set_position_line(3500);  // 1500 ฝั่งซ้าย   3500 ตรงกลาง  5500 ฝั่งขวา  // หรือใส่ค่าเท่าไรก็ได้ แต่ให้อยู่ในช่วง 0 - 7000; >>> 500   6500 โค้ง

  // // >>________เขียนโค้ดหลังจากบรรทัดนี้________________<<<<



}  //_________________ห้ามลบ__________________________

/* */