/*
_______________________ไจโร_________________________
fw_gyro(50, 0.85,  'คำสั่งถึงทางแยก');  //fw_gyro(ความเร็ว, Kp,  'คำสั่งถึงทางแยก'); 
fw_gyro(50, 50, 0.85, 30, 10);   //fw_gyro(ความเร็วซ้าย, ความเร็วขวา, Kp, ระยะทาง, เบรค);

bw_gyro(50, 0.85,  'คำสั่งถึงทางแยก') ;  //bw_gyro(ความเร็ว, Kp,  'คำสั่งถึงทางแยก'); 
bw_gyro(50, 50, 0.85, 30, 10);  //bw_gyro(ความเร็วซ้าย, ความเร็วขวา, Kp, ระยะทาง, เบรค);

Spin_left_gyro(30, 90, 10); //Spin_left_gyro(ความเร็ว, องศา, เบรค);
Spin_right_gyro(30, 90, 10); //Spin_right_gyro(ความเร็ว, องศา, เบรค);

_____________________ตรวจจับวัตถุ_____________________
FF_DISTANCE(30, 'คำสั่งถึงทางแยก', ระยะตรวจจับวัตถุ 500 > 2700); //เดินตามเส้นจนเจอวัตถุ
BB_DISTANCE(30, 'คำสั่งถึงทางแยก', ระยะตรวจจับวัตถุ 500 > 2700); //ถอยตามเส้นจนเจอวัตถุ

fw_gyro_dist(50, 0.85,  'คำสั่งถึงทางแยก',ระยะตรวจจับวัตถุ 500 > 2700);  //เดินหน้าไจโรจนเจอวัตถุวัตถุ
bw_gyro_dist(50, 0.85,  'คำสั่งถึงทางแยก',ระยะตรวจจับวัตถุ 500 > 2700);  //ถอยหลังไจโรจนกว่าไม่เจอวัตถุ

FD_Dist(50, 'คำสั่งถึงทางแยก', ระยะตรวจจับวัตถุ 500 > 2700); //เดินหน้าธรรมดา จนเจอวัตถุ
BK_Dist(50, 'คำสั่งถึงทางแยก', ระยะตรวจจับวัตถุ 500 > 2700); //ถอยหลังธรรมดา จนไม่เจอวัตถุ

SL_Dist(50, 'คำสั่งถึงทางแยก', ระยะตรวจจับวัตถุ 500 > 2700); //หมุนซ้ายจนเจอวัตถุ 
SR_Dist(50, 'คำสั่งถึงทางแยก', ระยะตรวจจับวัตถุ 500 > 2700); //หมุนขวาไม่เจอวัตถุ
_____________________________________________________________________________________________

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////// คู่มือการใช้งาน ////////////////////////////////////////////////////////////////////////////////////////////

// sw(); // wait for sw OK


////////////////////////////////// คำสั่ง Servo //////////////////////////////////////////////////////////////////
// >> ServoOpen(2);   // อ้าที่คีบ
// >> ServoClose(2);  // หนีบที่คีบ
// >> ServoUp(2);     // ยกที่คีบ
// >> ServoDown(2);   // วางที่คีบ
// >> ServoOpenLeft(2); //อ้าด้านซ้าย
// >> ServoOpenRight(2); //อ้าด้านขวา
// >> ServoCloseSmall(0); //หนีบเล็ก
// >> ServoCloseBig(0); //หนีบใหญ่
// >> Servo(90, 90, 90, ความเร็ว servo);
// >> Servo(90,90,90);
// >> servo(ช่องเซอร์โว 36 - 34 - 35, องศา);

////////////////////////////////// คำสั่งเคลื่อนที่ ///////////////////////////////////////////////////////////////////
// Motor(ความเร็วมอเตอร์ซ้าย , ความเร็วมอเตอร์ขวา); // คำสั่งเคลื่อนที่มอเตอร์
// Move(ความเร็วมอเตอร์ซ้าย , ความเร็วมอเตอร์ขวา, เวลาที่ใช้ ); // คำสั่งเคลื่อนที่มอเตอร์พร้อม delay เวลาที่ใช้ หน่วย 1000 = 1วินาที
// TestMotor(); //คำสั่งทดสอบมอเตอร์ โดยหมุนซ้ายไปข้างหน้าก่อน แล้วค่อยหมุนขวาไปข้างหน้า
// FD(ความเร็วมอเตอร์ , เวลาที่ใช้); //ไปข้างหน้า ตามเวลา
// BK(ความเร็วมอเตอร์ , เวลาที่ใช้); //ถอยหลัง ตามเวลา
// SL(ความเร็วมอเตอร์ , เวลาที่ใช้); //หมุนซ้าย ตามเวลา
// SR(ความเร็วมอเตอร์ , เวลาที่ใช้); //หมุนขวา ตามเวลา
// TL(ความเร็วมอเตอร์ , เวลาที่ใช้); //เลี้ยวซ้ายแบบล้อเดียว ตามเวลา
// TR(ความเร็วมอเตอร์ , เวลาที่ใช้); //เลี้ยวขวาแบบล้อเดียว ตามเวลา


////////////////////////////////// คำสั่งเลี้ยว //////////////////////////////////////////////////////////////////
// >> SpinL();                 // หมุนหุ่นยนต์ด้านซ้าย
// >> SpinL2();                // หมุนหุ่นยนต์ด้านซ้าย 2 แยก
// >> SpinR();                 // หมุนหุ่นยนต์ด้านขวา
// >> SpinR2();                // หมุนหุ่นยนต์ด้านขวา 2 แยก

////////////////////////////////// คำสั่งวิ่งนับแยก //////////////////////////////////////////////////////////////////
// >> คำสั่งเจอแยก 'l' = กลางหุ่นหน้าเลี้ยวซ้าย , 'r' = กลางหุ่นหน้าเลี้ยวขวา  , 'p' = ตรง     , 's' = หยุด        , 'c' = กลางหุ่นหน้า
// >> คำสั่งเจอแยก 'L' = กลางหุ่นเลี้ยวซ้าย    , 'R' = กลางหุ่นเลี้ยวขวา      , 'C' = กลางหุ่น , 'q' = หน้าเลี้ยวซ้าย , 'e' = หน้าเลี้ยวขวา


// >> FF(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ (0 && 7 || 0 && 2 || 5 && 7 ) // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ใดก็ได้
   
// >> FFC(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ (0 && 7 || 1 && 6  || 2 && 3 && 4 && 5)  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง
// >> FFC2(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ ( 0 && 7)  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง

// >> FFL(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ ( 0 && 2)  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย
// >> FFL2(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ ( 0 && 1 && 2 && 3 )  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย

// >> FFR(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ ( 5 && 7) // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
// >> FFR2(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ (  4 && 5 && 6 && 7)  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา

// >> FFNUM(ความเร็ว, 'คำสั่งเจอแยก', 0->7);  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์ที่ใช้จับแยก
// >> FF_DISTANCE(ความเร็ว, 'คำสั่งเจอแยก', 4->30);  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์วัดระยะ
// >> FFWhite(ความเร็ว,'คำสั่งเจอแยก'); //วิ่งตามเส้น PID ไปด้านหน้า ไปจนกว่าจะไม่เจอเส้น ให้ทำตามคำสั่ง
// >> FFBlack(ความเร็ว 'คำสั่งเจอแยก'); //หุ่นเคลื่อนที่ไปข้างหน้า จนกว่าจะเจอเส้นแล้ว ให้ทำตามคำสั่ง

// >> BB(ความเร็ว, 'คำสั่งเจอแยก'); //ใช้เซนเซอร์ (0 && 7 || 0 && 2 || 5 && 7 )  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ใดก็ได้

// >> BBC(ความเร็ว, 'คำสั่งเจอแยก'); // (0 && 7 || 1 && 6  || 2 && 3 && 4 && 5) // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง
// >> BBC2(ความเร็ว, 'คำสั่งเจอแยก'); // (0 && 7 ) // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง

// >> BBL(ความเร็ว, 'คำสั่งเจอแยก'); // ( 0 && 2)  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย
// >> BBL2(ความเร็ว, 'คำสั่งเจอแยก'); // ( 0 && 1 && 2 && 3 )  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย

// >> BBR(ความเร็ว, 'คำสั่งเจอแยก'); // ( 5 && 7)  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
// >> BBR2(ความเร็ว, 'คำสั่งเจอแยก'); // (  4 && 5 && 6 && 7)   // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
// >> BBNUM(ความเร็ว, 'คำสั่งเจอแยก', 0->7);  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์ที่ใช้จับแยก
// >> BBWhite(ความเร็ว,'คำสั่งเจอแยก'); //วิ่งตามเส้น PID ไปด้านหน้า ไปจนกว่าจะไม่เจอเส้น ให้ทำตามคำสั่ง
// >> BBBlack(ความเร็ว, 'คำสั่งเจอแยก'); //หุ่นเคลื่อนที่ไปข้างหน้า จนกว่าจะเจอเส้นแล้ว ให้ทำตามคำสั่ง

// >> FFtimer(ความเร็ว,เวลา);  // วิ่งตามเส้นด้วย PID Timer ไปข้างหน้า
// >> BBtimer(ความเร็ว,เวลา);  // วิ่งตามเส้นด้วย PID Timer ไปข้างหลัง

//_________วงกลม
// FFOL(int Speed, char select);
// FFOR(int Speed, char select);
// FFtimerOL(int baseSpeed, int totalTime);
// FFtimerOR(int baseSpeed, int totalTime);

// BBOL(int Speed, char select);
// BBOR(int Speed, char select);
// BBtimerOL(int baseSpeed, int totalTime);
// BBtimerOR(int baseSpeed, int totalTime);




//_______________________แบบกำหนด KP KD เอง ____________________________________________
// >> FF(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');   // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ใดก็ได้
// >> FFC(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง
// >> FFL(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย
// >> FFR(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
// >> FFNUM(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก', 0->7);  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์ที่ใช้จับแยก
// >> FF_DISTANCE(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก', 4->30);  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์วัดระยะ
// >> FFWhite(ความเร็ว,Kp,Kd,'คำสั่งเจอแยก'); //วิ่งตามเส้น PID ไปด้านหน้า ไปจนกว่าจะไม่เจอเส้น ให้ทำตามคำสั่ง


// >> BB(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');   // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ใดก็ได้
// >> BBC(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง
// >> BBL(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย
// >> BBR(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
// >> BBNUM(ความเร็ว,Kp,Kd, 'คำสั่งเจอแยก', 0->7);  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์ที่ใช้จับแยก
// >> BBWhite(ความเร็ว,Kp,Kd,'คำสั่งเจอแยก'); //วิ่งตามเส้น PID ไปด้านหน้า ไปจนกว่าจะไม่เจอเส้น ให้ทำตามคำสั่ง


// >> FFtimer(ความเร็ว,Kp,Kd,เวลา);  // วิ่งตามเส้นด้วย PID Timer ไปข้างหน้า
// >> BBtimer(ความเร็ว,Kp,Kd,เวลา);  // วิ่งตามเส้นด้วย PID Timer ไปข้างหลัง




*/
