void Mission() {
  //TestMotor(); //คำสั่งทดสอบมอเตอร์ โดยหมุนซ้ายไปข้างหน้าก่อน แล้วค่อยหมุนขวาไปข้างหน้า
  RefLineValue(400);           // ค่าในการจับเส้น เซนเซอร์หน้า หลัง
  RefCenterLineValue(400);     // ค่าในการจับเส้น เซนเซอร์คู่กลาง
  SetToCenterSpeed(30);        // ความเร็วเข้ากลางหุ่น
  SetTurnSpeed(40);            // ความเร็วเลี้ยวเข้าแยก l L r R
  TurnSpeedLeft(25, 80, 50);   //เลี้ยวแบบ q
  TurnSpeedRight(80, 25, 50);  //เลี้ยวแบบ e
  Delay_c_F(1500);             //เวลาเดินหน้า แบบ c
  Delay_c_B(1500);             //เวลาถอยหลัง แบบ c
  Dottedline(0);               //ไม่มีเส้นประใส่ 0 มีเส้นประใส่ 1
  ModeSpdPID(3, 100, -5);
  // ModeSpdPID(1, 100, -100);
  // ModeSpdPID(2, 100, -5);
  // >>________เขียนโค้ดหลังจากบรรทัดนี้________________<<<<
  // // box0();
  // box1();
  // box2();
  // box3();
  // box4();
  // box5();
  // finish();

  // Spin_right_gyro(30, 180, 10);
  // FFtimer(30,800);
}  //_________________ห้ามลบ__________________________